 # Лабораторная работа № 5. Доступ к сетевым устройствам по протоколу SSH.

 ##	Топология

 <img width="705" height="110" alt="image" src="https://github.com/user-attachments/assets/9b62b345-0e7c-4e3d-b42a-86231ec2414e" />


 ## 	Таблица адресации

 <img width="802" height="146" alt="image" src="https://github.com/user-attachments/assets/97553bc8-c252-4503-a5e3-44c233650af3" />


## 	Задачи
### Часть 1. Настройка основных параметров устройства
### Часть 2. Настройка маршрутизатора для доступа по протоколу SSH
### Часть 3. Настройка коммутатора для доступа по протоколу SSH
### Часть 4. SSH через интерфейс командной строки (CLI) коммутатора


## Решение

## Часть 1. Настройка основных параметров устройств.

### Шаг 1. Создаем сеть согласно топологии.

### Шаг 2. Настройка маршрутизатор и коммутатора.

`Прописываем базовые настройки для устройств, также настроил подключение по telnet, чтобы попрактиковаться и был доступ с пк на все устройства.`

### Шаг 3. Настройка компьютер PC-A.

`Настройка IP и шлюза`

### Шаг 4. Проверка подключение к сети.

`Проверка подлючения по telnet ко двум устройствам прошла успешно.`



## Часть 2. Настройка маршрутизатора для доступа по протоколу SSH

### Шаг 1. Настройте аутентификацию устройств.

    R1(config)#hostname R1
    R1(config)#ip domain-name otus.ru
    
### Шаг 2. Создайте ключ шифрования с указанием его длины и меняем версию SSH на вторую.

    R1(config)#crypto key generate rsa
    2048
    R1(config)#ip ssh version 2
    
### Шаг 3. Создайте имя пользователя в локальной базе учетных записей.
`Создаем пользователя с правами администратора`

    R1(config)#username sshadm privilege 15 secret cisco
    
### Шаг 4. Активируйте протокол SSH на линиях VTY.
`Так как при базовых настройках был поставлен пароль на VTY линии, его убираем, активируем SSH и убираем TELNET`

    R1(config)#line vty 0 4
    R1(config-line)#no password cisco
    R1(config-line)#no transport input telnet
    R1(config-line)#transport input ssh
    R1(config-line)#login local
    
    
### Шаг 5. Сохраните текущую конфигурацию в файл загрузочной конфигурации.
   
    R1#wr
    R1#reload
    
### Шаг 6. Установите соединение с маршрутизатором по протоколу SSH.

    C:\>ssh -l sshadm 192.168.1.1
    
`Подключеие удалось.`
## Часть 3. Настройка коммутатора для доступа по протоколу SSH

### Шаг 1. Настройте коммутатор для соединения по протоколу SSH.
`Пароль на привилегированный режим был установлен в базовых настройках, также отключаем TELNET`

    S1#conf t
    S1(config)#ip domain-name otus.ru
    S1(config)#crypto key generate rsa
    2048
    S1(config)#ip ssh v 2
    S1(config)#username sshuser secret class
    S1(config)#line vty 0 4
    S1(config-line)#login local
    S1(config-line)#no transport input telnet
    S1(config-line)#transport input ssh
    S1#wr
    S1#reload 
  
### Шаг 2. Установите соединение с коммутатором по протоколу SSH.

    C:\>ssh -l sshuser 192.168.1.11

    Password: 



`Подключение удалось.`

## Часть 4. Настройка протокола SSH с использованием интерфейса командной строки (CLI) коммутатора

`Тут я был не очень внимателен и на R1 создал пользователя не по методичке и на этом этапе не мог понять, откуда у нас взялся пользователь admin, у меня там sshadmin. Сейчас сделаю нового пользователя(или переделаю старого) как раз пойму, новая команда username создаст еще одного пользователя или переделает этого.`
`На этом этапе CPT слетел, так как я использовал VPN, начинаю делать настройки заново, создал двух локальных пользователей на коммутаторе, отвечаю на свой вопрос, еще одна команда username создает нового пользователя , не меняет старого.`
    
### Шаг 1. Посмотрите доступные параметры для клиента SSH в Cisco IOS.

    S1>ssh ?
    -l  Log in using this user name
    -v  Specify SSH Protocol Version
    
### Шаг 2. Установите с коммутатора S1 соединение с маршрутизатором R1 по протоколу SSH.
    
    S1>ssh -l admin 192.168.1.1

    Password: 
    % Login invalid


    Password: 

    FeelGood66

    R1#
    R1#
    Ctrl+Shift+6
    S1>
    S1>
    Enter
    [Resuming connection 1 to 192.168.1.1 ... ]

    R1#exit 

    [Connection to 192.168.1.1 closed by foreign host]
    S1>




## 	Вопрос для повторения

`Как предоставить доступ к сетевому устройству нескольким пользователям, у каждого из которых есть собственное имя пользователя?`

`Чтобы предоставить доступ разным пользователям, нужно создать этих пользователей с помощью username, а на линиях VTY сделать аутентификацию по локальной базе данных с помощью команды login local.`




#### Выгрузка из CPT [здесь](https://github.com/feelgood6/labs/blob/47817c57c825a8dd7988034c6601486424b64a06/labs/labs5/labs5.pkt)




